-- 1
SELECT "Н_ОЦЕНКИ"."ПРИМЕЧАНИЕ",
       "Н_ВЕДОМОСТИ"."ДАТА"
FROM "Н_ОЦЕНКИ"
         LEFT JOIN "Н_ВЕДОМОСТИ"
                   ON "Н_ОЦЕНКИ"."КОД" = "Н_ВЕДОМОСТИ"."ОЦЕНКА"
WHERE "Н_ОЦЕНКИ"."КОД" > '2'
  AND "Н_ОЦЕНКИ"."КОД" <= '5'
  AND "Н_ВЕДОМОСТИ"."ДАТА" = '1998-01-05'
  AND "Н_ВЕДОМОСТИ"."ДАТА" < '2010-06-18';

-- 2
SELECT "Н_ЛЮДИ"."ИМЯ",
       "Н_ВЕДОМОСТИ"."ЧЛВК_ИД",
       "Н_СЕССИЯ"."ИД"
FROM "Н_ВЕДОМОСТИ"
         LEFT JOIN "Н_ЛЮДИ" ON "Н_ВЕДОМОСТИ"."ЧЛВК_ИД" = "Н_ЛЮДИ"."ИД"
         LEFT JOIN "Н_СЕССИЯ" ON "Н_СЕССИЯ"."ИД" = "Н_ЛЮДИ"."ИД"
WHERE "Н_ЛЮДИ"."ИМЯ" = 'Владимир'
  AND "Н_ВЕДОМОСТИ"."ЧЛВК_ИД" = 105590;

-- 3
SELECT count(*)
FROM "Н_УЧЕНИКИ"
         JOIN "Н_ЛЮДИ"
              ON "Н_УЧЕНИКИ"."ЧЛВК_ИД" = "Н_ЛЮДИ"."ИД"
WHERE "Н_УЧЕНИКИ"."ГРУППА" = '3102'
  AND "Н_ЛЮДИ"."ДАТА_РОЖДЕНИЯ" + interval '20 years' > now();


-- 4
SELECT DISTINCT "Н_ГРУППЫ_ПЛАНОВ"."ПЛАН_ИД"
FROM "Н_ГРУППЫ_ПЛАНОВ"
         JOIN "Н_ПЛАНЫ"
              ON "Н_ПЛАНЫ"."ПЛАН_ИД" = "Н_ГРУППЫ_ПЛАНОВ"."ПЛАН_ИД"
         JOIN "Н_ОТДЕЛЫ"
              ON "Н_ОТДЕЛЫ"."ОТД_ИД" = "Н_ПЛАНЫ"."ОТД_ИД"
WHERE 2 > (SELECT count(*)
           WHERE "Н_ОТДЕЛЫ"."КОРОТКОЕ_ИМЯ" = 'КТиУ');

-- 5
SELECT "Н_УЧЕНИКИ"."ГРУППА", extract(days from avg(now() - "Н_ЛЮДИ"."ДАТА_РОЖДЕНИЯ")) / 365 AS СРЕДНИЙ_ВОЗРАСТ
FROM "Н_УЧЕНИКИ"
         JOIN "Н_ЛЮДИ" ON "Н_УЧЕНИКИ"."ЧЛВК_ИД" = "Н_ЛЮДИ"."ИД"
GROUP BY "Н_УЧЕНИКИ"."ГРУППА"
HAVING avg(now() - "Н_ЛЮДИ"."ДАТА_РОЖДЕНИЯ") < (SELECT avg(now() - "Н_ЛЮДИ"."ДАТА_РОЖДЕНИЯ")
                                            FROM "Н_ЛЮДИ"
                                                     JOIN "Н_УЧЕНИКИ" ON "Н_УЧЕНИКИ"."ЧЛВК_ИД" = "Н_ЛЮДИ"."ИД"
                                            WHERE "Н_УЧЕНИКИ"."ГРУППА" = '1100');

-- 6
SELECT "Н_УЧЕНИКИ"."ГРУППА", "Н_ЛЮДИ"."ФАМИЛИЯ", "Н_ЛЮДИ"."ИМЯ", "Н_ЛЮДИ"."ОТЧЕСТВО", "Н_УЧЕНИКИ"."ПЛАН_ИД"
FROM "Н_УЧЕНИКИ"
         JOIN "Н_ЛЮДИ" ON "Н_УЧЕНИКИ"."ЧЛВК_ИД" = "Н_ЛЮДИ"."ИД"
WHERE "Н_УЧЕНИКИ"."ПРИЗНАК" = 'отчисл'
  AND "Н_УЧЕНИКИ"."КОНЕЦ_ПО_ПРИКАЗУ" < '2012-09-01';

-- 7
SELECT count(*) AS ЧИСЛО_ТРОЕЧНИКОВ_ИТМО
FROM "Н_ЛЮДИ"
         JOIN "Н_ВЕДОМОСТИ" ON "Н_ВЕДОМОСТИ"."ЧЛВК_ИД" = "Н_ЛЮДИ"."ИД"
WHERE "Н_ВЕДОМОСТИ"."ОЦЕНКА" = '3';
